# Data Reshaping (Pivot & Melt)

Sometimes data is not in the required format.

We reshape data to:<br>
• prepare reports<br>
• build dashboards<br>
• compare categories<br>

Two main tools:
- pivot → long to wide
- melt → wide to long

In [1]:
import pandas as pd

# Load transformed data
sales = pd.read_csv("../data/processed/transformed_sales.csv")
sales.head()

,order_id,customer_id,product,category,price,quantity,city,date,total_amount,price_level,city_code
0,1001,C101,laptop,Tech,55000,1,Delhi,2024-01-05,55000,High,D
1,1002,C102,phone,Tech,20000,2,Mumbai,2024-01-06,40000,Medium,M
2,1003,C103,shoes,Fashion,3000,1,Pune,2024-01-07,3000,Low,P
3,1004,C101,headphones,Tech,2000,3,Delhi,2024-01-07,6000,Low,D
4,1005,C104,tshirt,Fashion,800,2,Bangalore,2024-01-08,1600,Low,B

## Pivot Table

Convert rows into columns

In [2]:
# Total sales by city and category
pivot_table = sales.pivot_table(
    values="total_amount",
    index="city",
    columns="category",
    aggfunc="sum"
)

pivot_table

category   Accessories  Fashion      Tech
city
Bangalore          NaN   5100.0       NaN
Chennai         2500.0      NaN       NaN
Delhi           3000.0      NaN   61000.0
Mumbai             NaN      NaN  100000.0
Pune               NaN   3000.0   18000.0

This format is useful for reports and comparisons.

## Melt (Opposite of Pivot)

Convert columns into rows

In [3]:
melted = pivot_table.reset_index().melt(
    id_vars="city",
    var_name="category",
    value_name="total_sales"
)

melted

         city     category  total_sales
0   Bangalore  Accessories          NaN
1     Chennai  Accessories       2500.0
2       Delhi  Accessories       3000.0
3      Mumbai  Accessories          NaN
4        Pune  Accessories          NaN
5   Bangalore      Fashion       5100.0
6     Chennai      Fashion          NaN
7       Delhi      Fashion          NaN
8      Mumbai      Fashion          NaN
9        Pune      Fashion       3000.0
10  Bangalore         Tech          NaN
11    Chennai         Tech          NaN
12      Delhi         Tech      61000.0
13     Mumbai         Tech     100000.0
14       Pune         Tech      18000.0

Melt makes data easier for plotting and analysis.

## Stack & Unstack

In [4]:
# stack converts columns to rows
stacked = pivot_table.stack()
stacked

city       category
Bangalore  Accessories         NaN
           Fashion          5100.0
           Tech                NaN
Chennai    Accessories      2500.0
           Fashion             NaN
           Tech                NaN
Delhi      Accessories      3000.0
           Fashion             NaN
           Tech            61000.0
Mumbai     Accessories         NaN
           Fashion             NaN
           Tech           100000.0
Pune       Accessories         NaN
           Fashion          3000.0
           Tech            18000.0
dtype: float64

In [5]:
# unstack converts rows back to columns
unstacked = stacked.unstack()
unstacked

category   Accessories  Fashion      Tech
city
Bangalore          NaN   5100.0       NaN
Chennai         2500.0      NaN       NaN
Delhi           3000.0      NaN   61000.0
Mumbai             NaN      NaN  100000.0
Pune               NaN   3000.0   18000.0

## Save Reshaped Data

In [6]:
melted.to_csv("../data/processed/reshaped_sales.csv", index=False)

## Conclusion

Reshaping helps present data in different analytical perspectives.